{
  "backend/main.mo": "Main Motoko actor that stores demo booking requests in a Map, exposes `submitDemoRequest`, `getAllDemoRequests`, and `getAllDemoRequestsByEmail` query/update methods, and uses a migration hook to upgrade from the old actor state.",
  "backend/migration.mo": "Migration module that defines the old and new actor state types and provides a `run` function to transform legacy email-list state into the new `demoRequests` Map structure.",
  "feature_evidence.json": "Feature evidence report mapping two implemented features — the demo booking form UI and the `useSubmitDemoRequest` React Query hook — to their source files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of every frontend source file, serving as a reference for the project's component and hook structure.",
  "frontend/index.css": "Tailwind base stylesheet defining CSS custom properties for light and dark color themes using OKLCH values for backgrounds, foregrounds, borders, and chart colors.",
  "frontend/index.html": "Minimal HTML entry point that mounts the React app into a `#root` div and loads the `main.tsx` module script.",
  "frontend/src/App.tsx": "Root React component that composes all marketing page sections in order, including the new `DemoBookingSection` placed between `CTASection` and `EmailCaptureSection`.",
  "frontend/src/components/CTASection.tsx": "Mid-page CTA section with a dark gradient card featuring a 'Start Your Free Trial' button scrolling to `#email-capture` and a 'Schedule a Demo' button smooth-scrolling to `#demo-booking`.",
  "frontend/src/components/DemoBookingSection.tsx": "Demo booking form section collecting full name, work email, company, team size (dropdown), and preferred contact time, with client-side validation and submission via the `useSubmitDemoRequest` hook, showing an inline success message on completion.",
  "frontend/src/components/EmailCaptureSection.tsx": "Early-access email capture form with validation, loading/error states, and a success confirmation message, integrated with the `useCaptureEmail` mutation hook.",
  "frontend/src/components/FeaturesSection.tsx": "Renders a 2x2 grid of feature cards (AI Analysis, Smart Shortlisting, Bias-Reduction, Hiring Insights) with icons, descriptions, and tags for the HR Buddy platform features section.",
  "frontend/src/components/Footer.tsx": "Displays the site footer with brand logo, tagline, social links (LinkedIn, X), and four columns of navigation links (Product, Company, Resources, Legal) on a dark background.",
  "frontend/src/components/HeroSection.tsx": "Full-screen hero section with headline copy, trust points, CTA buttons linking to email capture and how-it-works sections, and a dashboard mockup image on the right.",
  "frontend/src/components/HowItWorksSection.tsx": "Three-step process section (Upload & Define, AI Screens & Ranks, Review & Decide) displayed as cards with a connecting line on desktop and arrow connectors on mobile.",
  "frontend/src/components/MetricsSection.tsx": "Dark-themed metrics section displaying four key statistics (75% faster screening, 10K+ candidates, 92% satisfaction, 3× accuracy) in a responsive grid.",
  "frontend/src/components/Navbar.tsx": "Fixed top navigation bar with scroll-aware background, desktop nav links with smooth-scroll, Sign In and Start Free Trial CTAs, and a collapsible mobile menu.",
  "frontend/src/components/PartnersSection.tsx": "Social-proof section showing six placeholder partner company logos as styled abbreviation badges in a centered, grayscale flex row.",
  "frontend/src/components/TestimonialsSection.tsx": "Renders a testimonials section with three customer quote cards, each featuring a star rating, blockquote, and author avatar with initials.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing DFINITY Internet Identity authentication state, including login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Exports two React Query mutation hooks—useSubmitDemoRequest and useCaptureEmail—that call the backend actor to store demo requests and early-access email signups.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, configures Tailwind base/components/utilities, defines CSS custom properties for the HR Buddy teal/amber/charcoal brand theme, and adds utility classes like text-gradient-teal and section-padding.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom fonts (Sora/Inter), an extended oklch-based color palette for primary teal, amber, and slate scales, and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Project state manifest tracking the HR Buddy marketing site's version, architectural notes, known issues, and a list of implemented features with their requirement IDs."
}